
### Terragrunt diff


```diff


Acquiring state lock. This may take a few moments...
azurerm_resource_group.dev-rg: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg]
azurerm_private_dns_zone.phz: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/privateDnsZones/servrfarm.tech]
azurerm_ssh_public_key.ssh-pub-key: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Compute/sshPublicKeys/global-ssh-key]
azurerm_public_ip.ip-dev-box: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/publicIPAddresses/ip-address-dev-box]
azurerm_nat_gateway.ng-dev: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/natGateways/ng-dev]
azurerm_public_ip.ip-dev: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/publicIPAddresses/ip-dev]
azurerm_virtual_network.vnet-dev: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev]
azurerm_managed_disk.dev-box-storage: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Compute/disks/dev-box-storage]
azurerm_network_security_group.nsg-dev-box: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-dev-box]
azurerm_nat_gateway_public_ip_association.ng-dev-associate-public-ip: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/natGateways/ng-dev|/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/publicIPAddresses/ip-dev]
azurerm_subnet.subnet-pub-dev-01: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev/subnets/subnet-pub-dev-01]
azurerm_network_security_rule.nsg-dev-box-allow-ssh: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-dev-box/securityRules/AllowAnyInboundSSH]
azurerm_network_security_rule.ngs-dev-box-allow-80: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-dev-box/securityRules/AllowAnyInbound80]
azurerm_network_security_rule.ngs-dev-box-allow-443: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-dev-box/securityRules/AllowAnyInbound443]
azurerm_subnet_nat_gateway_association.name: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev/subnets/subnet-pub-dev-01]
azurerm_subnet_network_security_group_association.name: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev/subnets/subnet-pub-dev-01]
azurerm_network_interface.nif-dev-box: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkInterfaces/nif-dev-box]
azurerm_network_interface_security_group_association.assoc-nif-sg-dev-box: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkInterfaces/nif-dev-box|/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-dev-box]
azurerm_linux_virtual_machine.dev-box: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Compute/virtualMachines/dev-box.servrfarm.tech]
azurerm_virtual_machine_data_disk_attachment.attach-dev-box-storage-to-dev-box: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Compute/virtualMachines/dev-box.servrfarm.tech/dataDisks/dev-box-storage]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_private_dns_zone.phz will be destroyed
  # (because azurerm_private_dns_zone.phz is not in configuration)
  - resource "azurerm_private_dns_zone" "phz" {
      - id                                                    = "/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/privateDnsZones/servrfarm.tech" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "servrfarm.tech" -> null
      - number_of_record_sets                                 = 1 -> null
      - resource_group_name                                   = "dev-rg" -> null
      - tags                                                  = {} -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "servrfarm.tech." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # cloudflare_record.dev-box-dns-record-cloudflare will be created
  + resource "cloudflare_record" "dev-box-dns-record-cloudflare" {
      + allow_overwrite = true
      + comment         = "DNS record for dev-box.servrfarm.tech"
      + content         = "4.213.179.104"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "dev-box.servrfarm.tech"
      + proxiable       = (known after apply)
      + ttl             = 60
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...


```
